package com.ctnphrae.a036

import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import android.widget.ArrayAdapter
import android.widget.Toast
import kotlinx.android.synthetic.main.activity_main.*

class MainActivity : AppCompatActivity() {
    val titleArr = arrayOf("พวงนมหมูย่าง","ปลาทับทิมผัดขมิ้นขาว","ไข่พะโล้","ไก่ทอดหาดใหญ่","ยำอโวคาโดกับเนื้อปู","กบทอดกระเทียมพริกไทย","กุ้งผัดพริกเผา","ผัดพริกแกงไก่","ทอดมันหัวปลี","ไข่ลูกเขย","ปลากระพงทอดน้ำปลา","ต้มยำกุ้ง","ก๋วยเตี๋ยวต้มยำ","ผัดคะน้าหมูกรอบ","น้ำพริกปูม้า","ข้าวอบกุนเชียง","ปลากระพงราดซอสกะทิ","หอมหัวใหญ่ชุบแป้งทอด","ไข่เจียวลูกท้อ","ไก่ย่าง")
    val detailArr = arrayOf("จะใช้ถุงที่แก้มผลิตไฟฟ้าระหว่างนอน ถ้านอนไม่พอก็จะปล่อยได้แค่ไฟฟ้าอ่อนๆ",
        "ขอนำเสนอ อาหารไทย เมนูปิ้งย่าง อาหารอีสาน แบบง่ายๆ คือ พวงนมหมูย่าง เอกลักษณ์พิเศษของพวงนมหมู",
        "นำเสนอ อาหารจากปลาพระราชทาน ของ พระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดชบรมนาถพิตร รัชกาลที่ 9 คือ ปลาทับทิม",
        "ขอนำเสนอ ไข่พะโล้ เมนูอาหารที่ง่ายๆ สามารถหากินเองได้ตามตลาด และ ร้านอาหารข้าวราดแกงทั่วไป ด้วยคุณสมบัติของพะโล้",
        "อาหารไทย เมนูไก่ เมนูทอด เมนูอาหารอร่อยๆ ภาคใต้เรียก เหนียวไก่ วิธีทำไก่ทอดหาดใหญ่ ง่ายๆ สามารถทำกินเองที่บ้านได้ มีเอกลักษณ์ที่รสชาติ",
        "อาหารสูตรพิเศษ เมนูอโวคาโด วิธีทำยำอโวคาโดกับเนื้อปู ทำกินเองได้ เนื้ออโวคาโด นำมายำกับเนื้อปูสดๆ นำมานึ่ง ผสมกับน้ำซอสมะม่วง ที่มีกลิ่นหอม พริกกระเทียม และ เครื่องปรุงต่างๆ",
        "อาหารไทย เมนูเนื้อกบ วิธีทำกบทอดกระเทียมพริกไทย ง่ายๆทำกินเองได้ เคล็ดลับความอร่อย ทอดให้เหลืองกรอบ อาหารจานด่วน แบบง่ายๆ ",
        "เมนูผัดแบบง่ายๆ เมนูกุ้ง กุ้งทำอะไรกินได้บ้าง วิธีทำกุ้งผัดพริกเผา ทำกินเองได้ เคล็ดลับการปรุงรสให้อร่อย น้ำพริกเผาทำอะไรกินได้บ้าง กับข้าวจากกุ้ง เมนูผัด เมนูกุ้งผัด",
        "อาหาร เมนูไก่ผัด วิธีทำไก่ผัดพริกแกงมะละกอ แบบง่ายๆ ทำกินเองได้ ใส่ เส้นมะละกอกรอบๆ เพิ่มรสชาติความอร่อยให้กับเมนูไก่ พริกแกงทำอะไรกินได้บ้าง ไก่ทำอะไรกินดี มีมะละกอทำอะไรกินดี",
        "อาหารไทย เมนูทอด วิธีทำทอดมันหัวปลี ง่ายๆทำกินเองได้ นำกาบหัวปลี มาสับเป็นชิ้นเล็กๆ ผสมกับพริกแกงแดง และ หมูสับ พร้อมด้วยผสมอื่นๆของทอดมัน นำมาทำเป็นทอดมัน อาหารทอด แบบง่ายๆ เมนูหมู",
        "กับข้าวง่ายๆ ไข่ลูกเขย สูตรอาหารไทยยอดนิยม ภาษาอังกฤษ เรียก Fried egg with sweet sauce เมนูไข่ลูกเขย พบเห็นได้ง่ายตามร้านอาหาร ข้าวราดแกง",
        "ขอนำเสนอ ปลากระพงทอดน้ำปลา สูตรปลากระพงทอดน้ำปลา ภาษาอังกฤษ เรียก Snapper topped with sauce",
        "ต้มยำกุ้ง ภาษาอังกฤษ เรียก spicy soup with shrimp เป็น อาหารสุขภาพ อุดมไปด้วยสมุนไพร ข่า ตะไคร้ พริก ใบมะกรูด",
        "อาหารเมนูเส้น ยอดนอยม คือ ก๋วยเตี๋ยวต้มยำ ภาษาอังกฤษ เรียก Spicy Thai Noodles ความพิเศษของก๋วยเตี๋ยวต้มยำ",
        "ขอนำเสนอ สูตรน้ำพริก หอมๆ กินกับผักสดๆ นำเนื้อปูม้ามาทำ คือ น้ำพริกปูม้า",
        "ขอนำเสนอ ข้าวอบกุนเชียง อาหารยอดนิยม เมนูหนึ่ง ขั้นตอนการทำ และ ส่วนผสมหาง่าย การทำเข้าใจง่าย เหมาะสำหรับ คนรักการทำอาหาร",
        "ขอนำเสนอ อาหารไทย เมนูปลากระพงทอด ราดซอส สูตรพิเศษมีกะทิ ปลากระพงราดซอสกะทิ วิธีทำปลากระพงทอด ราดซอสกะทิทรางเครื่อง ปลากระพง",
        "ขอนำเสนอ อาหารทอด เมนูหอมหัวใหญ่ ชุปแป้งทอด หอมหัวใหญ่ชุบแป้งทอด เคล็ดลับความอร่อยอยู่ที่ การเตรียมหอมหัวใหญ่ การผสมแป้ง",
        "ขอนำเสนอ ไข่เจียวลูกท้อ เคล็ดลับการทำไข่เจียว เมนูลูกท้อ นั้น เทคนิคการทำ อยู่ที่ การตีไข่ การทอด",
        "ขอนำเสนอ อาหารไทย เมนูปิ้งย่าง คือ ไก่ย่าง เคล็ดลับความอร่อยของอาหารเมนูนี้ อยู่ที่ การหมักไก่ และ เทคนิคการย่าง ไก่ย่างนิยม การหมักไก่ย่าง")

    val context = this

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)
        setTitle("ข้อมูล Pokemon")
        val mAdapter = ArrayAdapter(context,
            android.R.layout.simple_list_item_1,
            titleArr)

        list_food.adapter = mAdapter

        list_food.setOnItemClickListener { parent, view, position, id ->

            Toast.makeText(
                context,
                "ข้อความ = ${titleArr[position]} , ข้อมูล = ${detailArr[position]}"
                , Toast.LENGTH_LONG
            ).show()
        }


    }
}
